'''
作者：一个搬砖的胖子
链接：https://www.nowcoder.com/discuss/450287?channel=2002&source_id=home_feed
来源：牛客网

猿辅导秋招已经开始了，对，就是那个实习生日薪800的猿辅导...猿辅导也是很爱考算法题的，甚至有小道消息说猿辅导有题库？
不管了，直接开怼，我总结了从现在到2019.8.30日的所有猿辅导的技术岗面经
并汇总了stitchohana大佬在2019.8.30汇总的算法题
所以本篇文章的数据应该是非常全的了（太久远的数据参考的意义其实不大）

如果你需要猿辅导内推，可以移步至猿辅导内推帖
如果你想了解其他公司的高频题目，可以移步至高频题仓库
后端
题目	频次
189. 旋转数组	3
剑指 Offer 27. 二叉树的镜像	3
113. 路径总和 II	3
1. 两数之和	2
面试题 03.05. 栈排序	2
74. 搜索二维矩阵	2
110. 平衡二叉树	2
222. 完全二叉树的节点个数	2
25. K 个一组翻转链表	2
剑指 Offer 36. 二叉搜索树与双向链表	2
98. 验证二叉搜索树	2
215. 数组中的第K个最大元素	2
7. 整数反转	1
102. 二叉树的层序遍历	1
562.矩阵中最长的连续1线段	1
41. 缺失的第一个正数	1
448. 找到所有数组中消失的数字	1
82. 删除排序链表中的重复元素 II	1
94. 二叉树的中序遍历	1
257. 二叉树的所有路径	1
124. 二叉树中的最大路径和	1
450. 删除二叉搜索树中的节点	1
40. 组合总和 II	1
658. 找到 K 个最接近的元素	1
316. 去除重复字母	1
86. 分隔链表	1
226. 翻转二叉树	1
剑指 Offer 22. 链表中倒数第k个节点	1
560. 和为K的子数组	1
442. 数组中重复的数据	1
1325. 删除给定值的叶子节点	1
剑指 Offer 25. 合并两个排序的链表	1
240. 搜索二维矩阵 II	1
958. 二叉树的完全性检验	1
239. 滑动窗口最大值	1
208. 实现 Trie (前缀树)	1
99. 恢复二叉搜索树	1
83. 删除排序链表中的重复元素	1
前端
题目	频次
102. 二叉树的层序遍历	2
56. 合并区间	2
199. 二叉树的右视图	1
面试题 02.05. 链表求和	1
206. 反转链表	1
105. 从前序与中序遍历序列构造二叉树	1
674. 最长连续递增序列	1
剑指 Offer 46. 把数字翻译成字符串	1
557. 反转字符串中的单词 III	1
153. 寻找旋转排序数组中的最小值	1
剑指 Offer 32 - III. 从上到下打印二叉树 III	1
剑指 Offer 29. 顺时针打印矩阵	1
179. 最大数	1
628. 三个数的最大乘积	1
328. 奇偶链表	1
客户端
题目	频次
86. 分隔链表	2
剑指 Offer 54. 二叉搜索树的第k大节点	1
83. 删除排序链表中的重复元素	1
80. 删除排序数组中的重复项 II	1
56. 合并区间	1
25. K 个一组翻转链表	1
236. 二叉树的最近公共祖先	1
算法
题目	频次
445. 两数相加 II	1
543. 二叉树的直径	1
83. 删除排序链表中的重复元素	1
面试题 03.05. 栈排序	1
1254. 统计封闭岛屿的数目	1
847. 访问所有节点的最短路径	1
25. K 个一组翻转链表	1
剑指 Offer 22. 链表中倒数第k个节点	1
测试
题目	频次
234. 回文链表	1
98. 验证二叉搜索树	1
662. 二叉树最大宽度	1
数据开发
题目	频次
518. 零钱兑换 II	1
1143. 最长公共子序列
'''